Autodesk.Revit.DB.MeshTriangle.Vertex(System.Int32)
A vertex of the triangle.
idx: Index of the vertex in the triangle: 0, 1 or 2.
The triangle only contains values at index 0, 1 or 2.

Autodesk.Revit.DB.MeshTriangle.Index(System.Int32)
The index of the vertex in the Vertices array of the mesh, for indexed access.
idx: Index of the vertex in the triangle: 0, 1 or 2.
The triangle only contains values at index 0, 1 or 2.

Autodesk.Revit.DB.MeshTriangle
One triangle of a mesh.